Revit 2027 API
Transform1D.Translation Property
 The translational part of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Translation { get; set; }
Public Property Translation As Double
	Get
	Set
public:
property double Translation {
	double get ();
	void set (double value);
}
member Translation : float with get, set
Property Value
Double
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace